# Напишите программу, удаляющую из текста все слова содержащие "абв".

my_text = input("")
res_my_text = my_text.replace("абв", "")
print(res_my_text)